In [2]:
# Import the Pandas Library
import pandas as pd

In [21]:
# Create a new dictionary
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

In [22]:
#casting the dictionary to a DataFrame
df = pd.DataFrame(x)
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [7]:
x = df[["ID"]]
x

   ID
0   1
1   2
2   3
3   4

In [8]:
type(x)

pandas.core.frame.DataFrame

In [9]:
#Retrieving the Department, Salary and ID columns and assigning it to a variable z

z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [24]:
x = {
    "Studen": ["David","Samuel","Terry","Evan"], 
    "Age": [27,24,22,32,], 
    "Country": ["UK","Canada","China","USA"], 
    "Course": ["Python","Data Structures","Machine Learning","Web Development"],
    "Marks": [85,72,89,76]
    }
df = pd.DataFrame(x)
df

   Studen  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada   Data Structures     72
2   Terry   22   China  Machine Learning     89
3    Evan   32     USA   Web Development     76

In [25]:
b = df[["Marks"]]
b

   Marks
0     85
1     72
2     89
3     76

In [26]:
# write your code here
c = df[["Country", "Course"]]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [15]:
type(x)

dict

loc() is a label-based data selecting method which means that we have to pass the name of the row or column that we want to select. This method includes the last element of the range passed in it.

Simple syntax for your understanding:

loc[row_label, column_label]
iloc() is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it.

Simple syntax for your understanding:

iloc[row_index, column_index]

In [27]:
df.iloc[0, 0]

'David'

In [28]:
df.iloc[0,2]

'UK'

In [29]:
df.loc[0, 'Country']

'UK'

Let us create a new dataframe called 'df2' and assign 'df' to it. Now, let us set the "Name" column as an index column using the method set_index().

In [32]:
df2=df
df2=df2.set_index("Country")
df2.head()

         Studen  Age            Course  Marks
Country
UK        David   27            Python     85
Canada   Samuel   24   Data Structures     72
China     Terry   22  Machine Learning     89
USA        Evan   32   Web Development     76

In [39]:
#Now, let us access the column using the Country
df2.loc['UK', 'Studen']

'David'

In [41]:
df2.loc['USA', 'Studen']

'Evan'

In [42]:
df3 = df2.iloc[3, 2]
df3

'Web Development'

Exercise 3: Slicing
Slicing uses the [] operator to select a set of rows and/or columns from a DataFrame.

In [43]:
df.iloc[0:2, 0:3]

   Studen  Age Country
0   David   27      UK
1  Samuel   24  Canada

NameError: name 'df' is not defined